Ruby_on_Rails/blog/app/views/posts/_postfull.html.erb

SELECT COUNT(*) FROM "posts"
---
    </p>
    <%if Post.count==0 %>